wms_mobile/src/Documents/итНаборка/итНаборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итНаборка</name>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>155</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FSRARID</name>
    <comment>ид для печати SSCC</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйПризнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесНаборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчередьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихКодыЯчеекДокумента</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wms_mobile/src/Enums/итWMSТипыЗадачТСД/итWMSТипыЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSТипыЗадачТСД</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>Наборка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКакЕсть</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>КонтрольнаяАгрегация</name>
  </enumValues>
  <enumValues>
    <name>Проверка</name>
  </enumValues>
  <enumValues>
    <name>Переупаковка</name>
  </enumValues>
</mdclass:Enum>

wms_mobile/src/Documents/итНаборка/Forms/ФормаНаборокКРаспределениюПоМаршрутам/Module.bsl
&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ОбработчикШтрихКода"  и ТригерПриемаСканераШтрихКода тогда
		Если Параметр=404 и Источник="ОшибкаЧтения" тогда
			ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Штрих код некорректен");
			Возврат
		КонецЕсли;	
		 ОбработчкаПолученияДанныхШтрихКода(Параметр);
	 КонецЕсли;

 КонецПроцедуры
&НаКлиенте
 Процедура ОбработчкаПолученияДанныхШтрихКода(Параметр)
	 КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
СтандартнаяОбработка=Ложь;
Строка=ТекущийЭлемент.ТекущиеДанные;
ОткрытьФорму("Документ.итНаборка.Форма.ФормаСпискаНаборокКРаспределениюМаршрута",новый Структура("МаршрутГУИД",Строка.МаршрутГУИД),ЭтаФорма);
ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьНаСервере()
	СтруктураДанных=новый Структура;
	СлужебныеФункцииИПроцедурыКлиентСервер.СформироватьСтруктуруДанныхОПользователе(СтруктураДанных);
	СтруктураДанных.Вставить("ТипЗадачи",Перечисления.итWMSТипыЗадачТСД.Наборка);
	ОбработчикиЗапросаСервера.ОбновитьСписокЗадачКРаспределению(СтруктураДанных);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда)
СтандартнаяОбработка=Ложь;
Строка=ТекущийЭлемент.ТекущиеДанные;
ОткрытьФорму("Документ.итНаборка.Форма.ФормаВыбораДействияМаршрут",новый Структура("МаршрутГУИД,Маршрут",Строка.МаршрутГУИД,Строка.Маршрут),ЭтаФорма);
ТригерПриемаСканераШтрихКода=Ложь;
КонецПроцедуры

&НаСервере
Процедура ТестПринятьНаборкуНаСервере(АдресДанных)
	СтруктураДанных=новый Структура;
	СлужебныеФункцииИПроцедурыКлиентСервер.СформироватьСтруктуруДанныхОПользователе(СтруктураДанных);
	СтруктураДанных.Вставить("КлючОперации","ПолучениеНовойНаборки");
    СтруктураДанных=ОбработчикиЗапросаСервера.ЗапроситьДанные(СтруктураДанных,"ServiceFunction");
	Если не СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураДанных) Тогда 
	МодульРаспределенияДанных.ОбработчикВходящихДанных(СтруктураДанных,АдресДанных);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТестПринятьНаборку(Команда)
	АдресДанных=ПоместитьВоВременноеХранилище(новый Структура,ЭтаФорма.УникальныйИдентификатор);
	ТестПринятьНаборкуНаСервере(АдресДанных);
	Данные=ПолучитьИзВременногоХранилища(АдресДанных);
	Если ТипЗнч(Данные)=Тип("Структура") Тогда 
		Если Данные.Свойство("МассивСозданныхОбъектовДанных") Тогда 
			Для Каждого стр из  Данные.МассивСозданныхОбъектовДанных Цикл 
				Если ТипЗнч(стр)=Тип("ДокументСсылка.итНаборка") Тогда 
					ОткрытьФорму("Документ.итНаборка.Форма.МоиЗадачиМаршрут",,ЭтаФорма);
					ТригерПриемаСканераШтрихКода=Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
